# Ethan Melsheimer
## 4/20/2023
### Python - Pandas DataFrame Functions - map(), apply(), groupby()

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
# Mapping
df = DataFrame({ 'city': ['Alma','Bria Head','Fox Park','Lake Mary'],
                  'altitude' :[10355,9800,9862,8966]})
df

        city  altitude
0       Alma     10355
1  Bria Head      9800
2   Fox Park      9862
3  Lake Mary      8966

In [3]:
st = {'Alma':'Colorado','Bria Head':'Utah','Fox Park':'Wyoming',
      'Lake Mary':'California'}
st

{'Alma': 'Colorado',
 'Bria Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(st)
df

        city  altitude       state
0       Alma     10355    Colorado
1  Bria Head      9800        Utah
2   Fox Park      9862     Wyoming
3  Lake Mary      8966  California

In [5]:
# Apply
df1 = df.copy()

def meter(x):
    return x / 3.2808

In [6]:
df['altitude'] = df['altitude'].apply(meter)

In [7]:
df

        city     altitude       state
0       Alma  3156.242380    Colorado
1  Bria Head  2987.076323        Utah
2   Fox Park  3005.974153     Wyoming
3  Lake Mary  2732.870032  California

In [8]:
df1['altitude'] = df1['altitude'].apply(lambda x:x / 3.2808)
df1

        city     altitude       state
0       Alma  3156.242380    Colorado
1  Bria Head  2987.076323        Utah
2   Fox Park  3005.974153     Wyoming
3  Lake Mary  2732.870032  California

In [9]:
df = DataFrame(np.random.randn(4,3),
              columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT -0.145400 -0.069960  0.793597
OH -1.633009 -0.933966 -0.811237
TX  0.073450  0.537065  0.091462
OR -0.251005 -2.213042  1.863301

In [10]:
df1 = df.copy()

def diff(c):
    return c.max() - c.min()

In [11]:
df.apply(diff)

b    1.706459
d    2.750107
e    2.674538
dtype: float64

In [12]:
df.apply(lambda x:x.max() - x.min())

b    1.706459
d    2.750107
e    2.674538
dtype: float64

In [13]:
df.apply(diff, axis=1)

UT    0.938997
OH    0.821772
TX    0.463615
OR    4.076343
dtype: float64

In [14]:
df.apply(lambda x:x.max() - x.min(),axis=1)

UT    0.938997
OH    0.821772
TX    0.463615
OR    4.076343
dtype: float64

In [15]:
df.apply(diff, axis='columns')

UT    0.938997
OH    0.821772
TX    0.463615
OR    4.076343
dtype: float64

In [16]:
df.apply(pd.value_counts)

             b    d    e
-2.213042  NaN  1.0  NaN
-1.633009  1.0  NaN  NaN
-0.933966  NaN  1.0  NaN
-0.811237  NaN  NaN  1.0
-0.251005  1.0  NaN  NaN
-0.145400  1.0  NaN  NaN
-0.069960  NaN  1.0  NaN
 0.073450  1.0  NaN  NaN
 0.091462  NaN  NaN  1.0
 0.537065  NaN  1.0  NaN
 0.793597  NaN  NaN  1.0
 1.863301  NaN  NaN  1.0

In [17]:
df.apply(pd.value_counts).fillna(0).astype('int')

           b  d  e
-2.213042  0  1  0
-1.633009  1  0  0
-0.933966  0  1  0
-0.811237  0  0  1
-0.251005  1  0  0
-0.145400  1  0  0
-0.069960  0  1  0
 0.073450  1  0  0
 0.091462  0  0  1
 0.537065  0  1  0
 0.793597  0  0  1
 1.863301  0  0  1

In [18]:
df

           b         d         e
UT -0.145400 -0.069960  0.793597
OH -1.633009 -0.933966 -0.811237
TX  0.073450  0.537065  0.091462
OR -0.251005 -2.213042  1.863301

In [19]:
df.apply(pd.value_counts,axis=1).fillna(0).astype('int')

,-2.213042,-1.633009,-0.933966,-0.811237,-0.251005,-0.145400,-0.069960,0.073450,0.091462,0.537065,0.793597,1.863301
UT,0,0,0,0,0,1,1,0,0,0,1,0
OH,0,1,1,1,0,0,0,0,0,0,0,0
TX,0,0,0,0,0,0,0,1,1,1,0,0
OR,1,0,0,0,1,0,0,0,0,0,0,1

In [20]:
# Grouping
df = DataFrame({ 'brand': ['Toyota','Ford','GMC','Ford','Toyota','GMC','GMC'],
                 'price': [40000,25000,30000,35000,50000,35000,32000]})
df

    brand  price
0  Toyota  40000
1    Ford  25000
2     GMC  30000
3    Ford  35000
4  Toyota  50000
5     GMC  35000
6     GMC  32000

In [21]:
df.groupby('brand').sum()

        price
brand
Ford    60000
GMC     97000
Toyota  90000

In [22]:
df.groupby('brand').mean()

               price
brand
Ford    30000.000000
GMC     32333.333333
Toyota  45000.000000

In [23]:
df.groupby('brand').count()

        price
brand
Ford        2
GMC         3
Toyota      2

In [24]:
df.groupby('brand')['price'].count()

brand
Ford      2
GMC       3
Toyota    2
Name: price, dtype: int64

In [25]:
s = df.groupby('brand')['price'].count()
s

brand
Ford      2
GMC       3
Toyota    2
Name: price, dtype: int64

In [26]:
type(s)

pandas.core.series.Series

In [28]:
d = df.groupby('brand')[['price']].count()
d

        price
brand
Ford        2
GMC         3
Toyota      2

In [29]:
type(d)

pandas.core.frame.DataFrame

In [30]:
df

    brand  price
0  Toyota  40000
1    Ford  25000
2     GMC  30000
3    Ford  35000
4  Toyota  50000
5     GMC  35000
6     GMC  32000

In [31]:
df['cum_sum'] = df.groupby('brand')['price'].cumsum()
df

    brand  price  cum_sum
0  Toyota  40000    40000
1    Ford  25000    25000
2     GMC  30000    30000
3    Ford  35000    60000
4  Toyota  50000    90000
5     GMC  35000    65000
6     GMC  32000    97000

In [32]:
df = DataFrame({'date': pd.date_range(start="2023-04-01", periods=8),
                "category": list('AAAABBBB'),
                "value": np.random.randint(10,30,size=8)
               })
df

        date category  value
0 2023-04-01        A     12
1 2023-04-02        A     19
2 2023-04-03        A     13
3 2023-04-04        A     28
4 2023-04-05        B     29
5 2023-04-06        B     26
6 2023-04-07        B     25
7 2023-04-08        B     27

In [34]:
df1 = df.copy()
df['cum_sum'] = df['value'].cumsum()
df

        date category  value  cum_sum
0 2023-04-01        A     12       12
1 2023-04-02        A     19       31
2 2023-04-03        A     13       44
3 2023-04-04        A     28       72
4 2023-04-05        B     29      101
5 2023-04-06        B     26      127
6 2023-04-07        B     25      152
7 2023-04-08        B     27      179

In [35]:
df['cum_sum'] = df.groupby('category')['value'].cumsum()
df

        date category  value  cum_sum
0 2023-04-01        A     12       12
1 2023-04-02        A     19       31
2 2023-04-03        A     13       44
3 2023-04-04        A     28       72
4 2023-04-05        B     29       29
5 2023-04-06        B     26       55
6 2023-04-07        B     25       80
7 2023-04-08        B     27      107

In [37]:
df = DataFrame({'k1': ['a','a','b','b','c'],
                'k2': ['one','two','one','two','one'],
                'dataset1': np.random.randn(5),
                'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.224390 -0.642833
1  a  two -0.653076 -0.743733
2  b  one  1.087626 -1.397744
3  b  two  1.833553  0.656915
4  c  one  0.674594  0.331481

In [38]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [39]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [40]:
df.groupby(['k1','k2']).sum()

        dataset1  dataset2
k1 k2
a  one  0.224390 -0.642833
   two -0.653076 -0.743733
b  one  1.087626 -1.397744
   two  1.833553  0.656915
c  one  0.674594  0.331481

In [41]:
df.groupby(['k1','k2'])[['dataset1']].sum()

        dataset1
k1 k2
a  one  0.224390
   two -0.653076
b  one  1.087626
   two  1.833553
c  one  0.674594

In [43]:
# Plot Data
ts = Series(np.random.randn(1000), index=pd.date_range("1/1/2023",period=1000))
ts

TypeError: _generate_range() got an unexpected keyword argument 'period'

In [44]:
ts = ts.cumsum()
ts

NameError: name 'ts' is not defined

In [45]:
ts.plot

NameError: name 'ts' is not defined